Repository: jehkinen/canto
Catalog: Canto/Resources/Localizable.xcstrings
Source language: en
Languages: he, ru

source: Unload the model after
he: פריקת המודל מהזיכרון אחרי
ru: Выгружать модель через

source: Until %@ is downloaded, %@ recognizes your speech.
he: עד שההורדה של %1$@ תסתיים, %2$@ מזהה את הדיבור.
ru: Пока %1$@ загружается, речь распознаёт %2$@.

source: Use Caps Lock as the dictation key
he: Caps Lock כמקש ההכתבה
ru: Caps Lock — клавиша диктовки

source: Use Default Folder
he: שימוש בתיקיית ברירת המחדל
ru: Папка по умолчанию

source: Use the GPU (Metal)
he: שימוש ב-GPU (Metal)
ru: Использовать GPU (Metal)

source: Use this model
he: שימוש במודל הזה
ru: Использовать эту модель

source: Version %@
he: גרסה %@
ru: Версия %@

source: Vocabulary
he: מילון
ru: Словарь

source: Welcome to Canto
he: ברוכים הבאים ל-Canto
ru: Добро пожаловать в Canto

source: What is this?
he: מה זה?
ru: Что это?

source: What the model heard, before punctuation, numbers and the skill
he: מה שהמודל שמע, לפני פיסוק, מספרים ומיומנות
ru: Что услышала модель, до пунктуации, чисел и скилла

source: While Canto runs, Caps Lock acts as F18 and becomes the shortcut. Turn this off or quit Canto to get Caps Lock back.
he: כל עוד Canto פועל, Caps Lock מתפקד כ-F18 והופך לקיצור ההכתבה. כדי לקבל את Caps Lock בחזרה, יש לכבות את האפשרות או לצאת מ-Canto.
ru: Пока Canto открыто, Caps Lock действует как F18 и становится сочетанием для диктовки. Выключите параметр или закройте Canto, чтобы вернуть Caps Lock.

source: Whisper: 99 languages, takes the vocabulary into account while recognizing
he: Whisper: 99 שפות, מתחשב במילון בזמן הזיהוי
ru: Whisper: 99 языков, учитывает словарь при распознавании

source: Words: twenty-five
he: מילים: עשרים וחמש
ru: Словами: двадцать пять

source: Write numbers as words
he: כתיבת מספרים במילים
ru: Писать числа словами

source: Your OpenAI API key is saved.
he: מפתח ה-API של OpenAI נשמר.
ru: Ключ API OpenAI сохранён.

source: Your dictation key
he: מקש ההכתבה
ru: Клавиша диктовки

source: Your latest transcripts will appear here
he: התמלולים האחרונים יופיעו כאן
ru: Здесь появятся последние расшифровки

source: Your models, history, skills and API key are kept.
he: המודלים, ההיסטוריה, המיומנויות ומפתח ה-API יישמרו.
ru: Модели, история, скиллы и ключ API сохранятся.

source: for example “send it”
he: למשל "לשלוח"
ru: например «отправить»

source: macOS will ask to allow access to the selected item.
he: macOS יבקש לאשר גישה לפריט שנבחר.
ru: macOS попросит разрешить доступ к выбранной записи.

source: whisper.cpp on GitHub
he: whisper.cpp ב-GitHub
ru: whisper.cpp на GitHub

source: “%@” does not look like an OpenAI key
he: "%@" לא נראה כמו מפתח OpenAI
ru: «%@» не похоже на ключ OpenAI

source: “42” becomes “forty-two”.
he: "42" יהפוך ל"ארבעים ושתיים".
ru: «42» станет «сорок два».

source: “50 dollars” becomes “$50”, “50 euros” becomes “50 €”.
he: "50 דולר" יהפוך ל-"$50", "50 יורו" ל-"50 €".
ru: «50 долларов» станет «$50», «50 евро» станет «50 €».

source: AI
ru: ИИ
